Revit 2027 API
ParameterTypeId.RebarBarCrankLengths Property
 "Crank Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarCrankLengths { get; }
Public Shared ReadOnly Property RebarBarCrankLengths As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarCrankLengths {
	ForgeTypeId^ get ();
}
static member RebarBarCrankLengths : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace